darren1713/elua/src/platform/stm32l4/platform.c
  for( port = 0; port < NUM_PIO; port++ )
  {
    // Enable clock to port.
    LL_AHB2_GRP1_EnableClock(pio_port_clk[port]);

    // Default all port pins to input and enable port.
    LL_GPIO_StructInit(&GPIO_InitStructure);
  
    //Protect JTAG pins from getting disconnected. In circuit debugging stops working if not skipped
    if(pio_port[port] == GPIOA)
      GPIO_InitStructure.Pin &= ~(LL_GPIO_PIN_13 | LL_GPIO_PIN_14 | LL_GPIO_PIN_15);
    if(pio_port[port] == GPIOB)
      GPIO_InitStructure.Pin &= ~(LL_GPIO_PIN_3 | LL_GPIO_PIN_4);
  
    LL_GPIO_Init(pio_port[port], &GPIO_InitStructure);
  }

#if defined(ENABLE_JTAG_SWD) || defined(ENABLE_TRACE)
  //Mapping JTAG / SWD pins
  //LL_GPIO_SetAFPin_0_7(GPIOB, LL_GPIO_AF_4,  GPIO_AF0_SWJ); // PB4  TRST
  //LL_GPIO_SetAFPin_0_7(GPIOB, LL_GPIO_AF_3,  GPIO_AF0_SWJ); // PB3  TDO   / SWO

  //LL_GPIO_SetAFPin_8_15(GPIOA, LL_GPIO_AF_13, GPIO_AF0_SWJ); // PA13 TMS   / SWDIO
  //LL_GPIO_SetAFPin_8_15(GPIOA, LL_GPIO_AF_14, GPIO_AF0_SWJ); // PA14 TCK   / SWDCLK
  //LL_GPIO_SetAFPin_8_15(GPIOA, LL_GPIO_AF_15, GPIO_AF0_SWJ); // PA15 TDI

  GPIO_InitStructure.Pin = LL_GPIO_PIN_13 | LL_GPIO_PIN_15;
  GPIO_InitStructure.Mode = LL_GPIO_MODE_ALTERNATE;
  GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStructure.Pull = LL_GPIO_PULL_UP;
  GPIO_InitStructure.Alternate = GPIO_AF0_SWJ;
  LL_GPIO_Init(GPIOA, &GPIO_InitStructure);

  GPIO_InitStructure.Pin = LL_GPIO_PIN_3 | LL_GPIO_PIN_4;
  LL_GPIO_Init(GPIOB, &GPIO_InitStructure);

  GPIO_InitStructure.Pin = LL_GPIO_PIN_14;
  GPIO_InitStructure.Pull = LL_GPIO_PULL_DOWN;
  LL_GPIO_Init(GPIOA, &GPIO_InitStructure);

#endif

#ifdef ENABLE_TRACE
  //Mapping TRACE pins, PE2,3,4,5,6
  GPIO_InitStructure.Pin = LL_GPIO_PIN_2 | LL_GPIO_PIN_3 | LL_GPIO_PIN_4 | LL_GPIO_PIN_5 | LL_GPIO_PIN_6;
  LL_GPIO_Init(GPIOE, &GPIO_InitStructure);

  LL_GPIO_SetAFPin_0_7(GPIOE, LL_GPIO_AF_2, GPIO_AF_TRACE);
  LL_GPIO_SetAFPin_0_7(GPIOE, LL_GPIO_AF_3, GPIO_AF_TRACE);
  LL_GPIO_SetAFPin_0_7(GPIOE, LL_GPIO_AF_4, GPIO_AF_TRACE);
  LL_GPIO_SetAFPin_0_7(GPIOE, LL_GPIO_AF_5, GPIO_AF_TRACE);
  LL_GPIO_SetAFPin_0_7(GPIOE, LL_GPIO_AF_6, GPIO_AF_TRACE);
#endif

  LL_GPIO_StructInit(&GPIO_InitStructure);
  GPIO_InitStructure.Pin   = LL_GPIO_PIN_5;
  GPIO_InitStructure.Mode  = LL_GPIO_MODE_OUTPUT;
  GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_HIGH;
  LL_GPIO_Init(GPIOA, &GPIO_InitStructure);
  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_5);
}

pio_type platform_pio_op( unsigned port, pio_type pinmask, int op )
{
  pio_type retval = 1;
  LL_GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_TypeDef * base = pio_port[ port ];

  switch( op )
  {
    case PLATFORM_IO_PORT_SET_VALUE:
      LL_GPIO_WriteOutputPort(base, pinmask);
      break;

    case PLATFORM_IO_PIN_SET:
      LL_GPIO_SetOutputPin(base, pinmask);
      break;

    case PLATFORM_IO_PIN_CLEAR:
      LL_GPIO_ResetOutputPin(base, pinmask);
      break;

    case PLATFORM_IO_PORT_DIR_INPUT:
      pinmask = LL_GPIO_PIN_ALL;
    case PLATFORM_IO_PIN_DIR_INPUT:
      LL_GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin  = pinmask;
      GPIO_InitStructure.Mode = LL_GPIO_MODE_INPUT;

      LL_GPIO_Init(base, &GPIO_InitStructure);
      break;

    case PLATFORM_IO_PORT_DIR_OUTPUT:
      pinmask = LL_GPIO_PIN_ALL;
    case PLATFORM_IO_PIN_DIR_OUTPUT:
      LL_GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin   = pinmask;
      GPIO_InitStructure.Mode  = LL_GPIO_MODE_OUTPUT;
      GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_HIGH;

      LL_GPIO_Init(base, &GPIO_InitStructure);
      break;

    case PLATFORM_IO_PORT_GET_VALUE:
      retval = pinmask == PLATFORM_IO_READ_IN_MASK ? LL_GPIO_ReadInputPort(base) : LL_GPIO_ReadOutputPort(base);
      break;

    case PLATFORM_IO_PIN_GET:
      retval = LL_GPIO_IsInputPinSet(base, pinmask);
      break;

    case PLATFORM_IO_PIN_PULLUP:
      LL_GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin   = pinmask;
      GPIO_InitStructure.Pull = LL_GPIO_PULL_UP;

      LL_GPIO_Init(base, &GPIO_InitStructure);
      break;

    case PLATFORM_IO_PIN_PULLDOWN:
      LL_GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin   = pinmask;
      GPIO_InitStructure.Pull  = LL_GPIO_PULL_DOWN;

      LL_GPIO_Init(base, &GPIO_InitStructure);
      break;

    case PLATFORM_IO_PIN_NOPULL:
      LL_GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin   = pinmask;
      GPIO_InitStructure.Pull  = LL_GPIO_PULL_NO;

      LL_GPIO_Init(base, &GPIO_InitStructure);
      break;

    default:
      retval = 0;
      break;
  }
  return retval;
}

// ****************************************************************************
// SPI
// NOTE: Only configuring 2 SPI peripherals, since the third one shares pins with JTAG

static SPI_TypeDef *const spi[]  = { SPI1, SPI2, SPI3 };
static const u8 spi_AF[]  = { GPIO_AF5_SPI1, GPIO_AF5_SPI2, GPIO_AF6_SPI3 };

static const u16 spi_prescaler[] = { LL_SPI_BAUDRATEPRESCALER_DIV2, LL_SPI_BAUDRATEPRESCALER_DIV4, LL_SPI_BAUDRATEPRESCALER_DIV8,
                                     LL_SPI_BAUDRATEPRESCALER_DIV16, LL_SPI_BAUDRATEPRESCALER_DIV32, LL_SPI_BAUDRATEPRESCALER_DIV64,
                                     LL_SPI_BAUDRATEPRESCALER_DIV128, LL_SPI_BAUDRATEPRESCALER_DIV256 };

static const u8 spi_gpio_pins_source[][3] = {
  //SCK,    MISO,   MOSI
  {LL_GPIO_AF_5  , LL_GPIO_AF_6  , LL_GPIO_AF_7},
  {LL_GPIO_AF_13 , LL_GPIO_AF_14 , LL_GPIO_AF_15},
  {LL_GPIO_AF_10 , LL_GPIO_AF_11 , LL_GPIO_AF_12}
};

static const u16 spi_gpio_pins[] = { LL_GPIO_PIN_5  | LL_GPIO_PIN_6  | LL_GPIO_PIN_7,
                                     LL_GPIO_PIN_13 | LL_GPIO_PIN_14 | LL_GPIO_PIN_15,
                                     LL_GPIO_PIN_10 | LL_GPIO_PIN_11 | LL_GPIO_PIN_12,
                                   };
//                                   SCK           MISO          MOSI
static GPIO_TypeDef *const spi_gpio_port[] = { GPIOA, GPIOB, GPIOC };

