darren1713/elua/src/platform/stm32l4/platform.c
static void spis_init()
{
  // Enable Clocks
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1);
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2);
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI3);
}

#define SPI_GET_BASE_CLK( id ) ( ( id ) == 0 ? ( HCLK / PCLK2_DIV ) : ( HCLK / PCLK1_DIV ) )

u32 platform_spi_setup( unsigned id, int mode, u32 clock, unsigned cpol, unsigned cpha, unsigned databits )
{
  LL_SPI_InitTypeDef SPI_InitStructure;
  LL_GPIO_InitTypeDef GPIO_InitStructure;
  LL_SPI_StructInit(&SPI_InitStructure);
  u8 prescaler_idx = intlog2( ( unsigned ) ( SPI_GET_BASE_CLK( id ) / clock ) );
  //int i;

  if ( prescaler_idx < 0 )
    prescaler_idx = 0;
  if ( prescaler_idx > 7 )
    prescaler_idx = 7;

  //Connect pin to SPI
  //for(i = 0; i < 3; i++)
  //{
  //  LL_GPIO_SetAFPin_0_7(spi_gpio_port[id], spi_gpio_pins_source[id][i], spi_AF[id]);
  //}

  /* Configure SPI pins */
  LL_GPIO_StructInit(&GPIO_InitStructure);
  GPIO_InitStructure.Pin = spi_gpio_pins[ id ];
  GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStructure.Mode = LL_GPIO_MODE_ALTERNATE;
  GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStructure.Pull = LL_GPIO_PULL_UP; //pull-up or pull-down
  GPIO_InitStructure.Alternate = spi_AF[id];
  LL_GPIO_Init(spi_gpio_port[ id ], &GPIO_InitStructure);

  LL_SPI_DeInit(spi[ id ]);

  /* Take down, then reconfigure SPI peripheral */
  LL_SPI_Disable( spi[ id ] );
  SPI_InitStructure.TransferDirection = LL_SPI_FULL_DUPLEX;
  SPI_InitStructure.Mode = mode ? LL_SPI_MODE_MASTER : LL_SPI_MODE_SLAVE;
  SPI_InitStructure.DataWidth = ( databits == 16 ) ? LL_SPI_DATAWIDTH_16BIT : LL_SPI_DATAWIDTH_8BIT; // not ideal, but defaults to sane 8-bits
  SPI_InitStructure.ClockPolarity = cpol ? LL_SPI_POLARITY_HIGH : LL_SPI_POLARITY_LOW;
  SPI_InitStructure.ClockPhase = cpha ? LL_SPI_PHASE_2EDGE : LL_SPI_PHASE_1EDGE;
  SPI_InitStructure.NSS = LL_SPI_NSS_SOFT;
  SPI_InitStructure.BaudRate = spi_prescaler[ prescaler_idx ];
  SPI_InitStructure.BitOrder = LL_SPI_MSB_FIRST;
  SPI_InitStructure.CRCPoly = 7;
  LL_SPI_Init( spi[ id ], &SPI_InitStructure );
  LL_SPI_Enable( spi[ id ] );

  return ( SPI_GET_BASE_CLK( id ) / ( ( ( u16 )2 << ( prescaler_idx ) ) ) );
}

spi_data_type platform_spi_send_recv( unsigned id, spi_data_type data )
{
  if(LL_SPI_GetDataWidth(spi[ id ]) == LL_SPI_DATAWIDTH_16BIT)
    LL_SPI_TransmitData16( spi[ id ], data );
  else
    LL_SPI_TransmitData8( spi[ id ], data );

  while ( LL_SPI_IsActiveFlag_RXNE( spi[ id ] ) == 0 );

  if(LL_SPI_GetDataWidth(spi[ id ]) == LL_SPI_DATAWIDTH_16BIT)
    return LL_SPI_ReceiveData16( spi[ id ] );
  else
    return LL_SPI_ReceiveData8( spi[ id ] );
}

void platform_spi_select( unsigned id, int is_select )
{
  // This platform doesn't have a hardware SS pin, so there's nothing to do here
  id = id;
  is_select = is_select;
}


// ****************************************************************************
// UART
// TODO: Support timeouts.

// All possible STM32 uarts defs
USART_TypeDef *const stm32_usart[] =          { USART1, USART2, USART3, UART4, UART5, LPUART1};
const u8 stm32_usart_AF[] =       { GPIO_AF7_USART1, GPIO_AF7_USART2, GPIO_AF7_USART3, GPIO_AF8_UART4, GPIO_AF8_UART5, GPIO_AF8_LPUART1};
static GPIO_TypeDef *const usart_gpio_rx_port[] = { GPIOA, GPIOA, GPIOC, GPIOC, GPIOD };
static GPIO_TypeDef *const usart_gpio_tx_port[] = { GPIOA, GPIOA, GPIOC, GPIOC, GPIOD };
static const u16 usart_gpio_rx_pin[] = { LL_GPIO_PIN_10, LL_GPIO_PIN_3, LL_GPIO_PIN_11, LL_GPIO_PIN_11, LL_GPIO_PIN_2 };
static const u8 usart_gpio_rx_pin_source[] = { LL_GPIO_AF_10, LL_GPIO_AF_3, LL_GPIO_AF_11, LL_GPIO_AF_11, LL_GPIO_AF_2 };
static const u16 usart_gpio_tx_pin[] = { LL_GPIO_PIN_9, LL_GPIO_PIN_2, LL_GPIO_PIN_10, LL_GPIO_PIN_10, LL_GPIO_PIN_12 };
static const u8 usart_gpio_tx_pin_source[] = { LL_GPIO_AF_9, LL_GPIO_AF_2, LL_GPIO_AF_10, LL_GPIO_AF_10, LL_GPIO_AF_12 };


static GPIO_TypeDef *const usart_gpio_hwflow_port[] = { GPIOA, GPIOA, GPIOB };
static const u16 usart_gpio_cts_pin[] = { LL_GPIO_PIN_11, LL_GPIO_PIN_0, LL_GPIO_PIN_13 };
static const u16 usart_gpio_rts_pin[] = { LL_GPIO_PIN_12, LL_GPIO_PIN_1, LL_GPIO_PIN_14 };

static void usart_init(u32 id, LL_USART_InitTypeDef * initVals)
{
  /* Configure USART IO */
  LL_GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_TypeDef* prxport = usart_gpio_rx_port[ id ];
  GPIO_TypeDef* ptxport = usart_gpio_tx_port[ id ];
  u16 gpio_rx_pin = usart_gpio_rx_pin[ id ];
  u16 gpio_tx_pin = usart_gpio_tx_pin[ id ];

  // Overwrite console UART configuration with the parameters from the configuration file
/* Set this based on hardware...
  if( id == CON_UART_ID )
  {
    prxport = CON_GPIO_PORT_MACRO( STM32L4_CON_RX_PORT );
    ptxport = CON_GPIO_PORT_MACRO( STM32L4_CON_TX_PORT );
    gpio_rx_pin = CON_GPIO_PIN_MACRO( STM32L4_CON_RX_PIN );
    gpio_tx_pin = CON_GPIO_PIN_MACRO( STM32L4_CON_TX_PIN );
    gpio_rx_pinsource = CON_GPIO_SOURCE_MACRO( STM32L4_CON_RX_PIN );
    gpio_tx_pinsource = CON_GPIO_SOURCE_MACRO( STM32L4_CON_TX_PIN );
  }*/

  /* Configure USART Tx Pin as alternate function push-pull */
  LL_GPIO_StructInit(&GPIO_InitStructure);
  GPIO_InitStructure.Pin = gpio_tx_pin;
  GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStructure.Mode = LL_GPIO_MODE_ALTERNATE;
  GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL; //push pull or open drain
  GPIO_InitStructure.Pull = LL_GPIO_PULL_UP; //pull-up or pull-down
  GPIO_InitStructure.Alternate = stm32_usart_AF[id];
  LL_GPIO_Init(ptxport, &GPIO_InitStructure);

  /* Configure USART Rx Pin as input floating */
  GPIO_InitStructure.Pin = gpio_rx_pin;
  GPIO_InitStructure.Alternate = stm32_usart_AF[id];
  LL_GPIO_Init(prxport, &GPIO_InitStructure);

  LL_USART_DeInit(stm32_usart[id]);

  /* Configure USART */
  LL_USART_Init(stm32_usart[id], initVals);

  /* Enable USART */
  LL_USART_Enable(stm32_usart[id]);
}

static void uarts_init()
{
  // Enable clocks.
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2);
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3);
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART4);
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART5);
  //LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_LPUART1, ENABLE);
}

u32 platform_uart_setup( unsigned id, u32 baud, int databits, int parity, int stopbits )
{
  LL_USART_InitTypeDef USART_InitStructure;

  if( id == CDC_UART_ID ) // no dynamic configuration yet
    return 0;

