darren1713/elua/src/platform/stm32l4/platform.c
  LL_USART_StructInit(&USART_InitStructure);
  USART_InitStructure.BaudRate = baud;
  USART_InitStructure.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  USART_InitStructure.TransferDirection = LL_USART_DIRECTION_TX_RX;

  switch( databits )
  {
    case 5:
    case 6:
    case 7:
    case 8:
      USART_InitStructure.DataWidth = LL_USART_DATAWIDTH_8B;
      break;
    case 9:
      //USART_InitStructure.DataWidth = LL_USART_DATAWIDTH_9B; //Have to update receive functions to properly receive 9 bits
      //break;
    default:
      USART_InitStructure.DataWidth = LL_USART_DATAWIDTH_8B;
      break;
  }

  switch (stopbits)
  {
    case PLATFORM_UART_STOPBITS_1:
      USART_InitStructure.StopBits = LL_USART_STOPBITS_1;
      break;
    case PLATFORM_UART_STOPBITS_2:
      USART_InitStructure.StopBits = LL_USART_STOPBITS_2;
      break;
    default:
      USART_InitStructure.StopBits = LL_USART_STOPBITS_1;
      break;
  }

  switch (parity)
  {
    case PLATFORM_UART_PARITY_EVEN:
      USART_InitStructure.Parity = LL_USART_PARITY_EVEN;
      break;
    case PLATFORM_UART_PARITY_ODD:
      USART_InitStructure.Parity = LL_USART_PARITY_ODD;
      break;
    default:
      USART_InitStructure.Parity = LL_USART_PARITY_NONE;
      break;
  }

  usart_init(id, &USART_InitStructure);

  return baud;
}

extern uint16_t VCP_DataTx(uint8_t* Buf, uint32_t Len);
void platform_s_uart_send( unsigned id, u8 data )
{
#ifdef BUILD_USB_CDC
  if( id == CDC_UART_ID )
    VCP_DataTx( &data, 1 );
  else
#endif  
  {
    while(LL_USART_IsActiveFlag_TXE(stm32_usart[id]) == 0);
    LL_USART_TransmitData8(stm32_usart[id], data);
  }
}

int platform_s_uart_recv( unsigned id, timer_data_type timeout )
{
  if( id == CDC_UART_ID ) // this shouldn't happen
    return -1;
  if( timeout == 0 )
  {
    if (LL_USART_IsActiveFlag_RXNE(stm32_usart[id]) == 0)
      return -1;
    else
      return LL_USART_ReceiveData8(stm32_usart[id]);
  }
  // Receive char blocking
  while(LL_USART_IsActiveFlag_RXNE(stm32_usart[id]) == 0);
  return LL_USART_ReceiveData8(stm32_usart[id]);
}

int platform_s_uart_set_flow_control( unsigned id, int type )
{
  USART_TypeDef *usart = stm32_usart[ id ];
  int temp = 0;
  LL_GPIO_InitTypeDef GPIO_InitStructure;

  if( id >= 3 ) // on STM32 only USART1 through USART3 have hardware flow control ([TODO] but only on high density devices?)
    return PLATFORM_ERR;

  LL_GPIO_StructInit(&GPIO_InitStructure);
  GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStructure.Mode = LL_GPIO_MODE_INPUT;

  if( type == PLATFORM_UART_FLOW_NONE )
  {
    usart->CR3 &= ~LL_USART_HWCONTROL_RTS_CTS;
    GPIO_InitStructure.Pin = usart_gpio_rts_pin[ id ] | usart_gpio_cts_pin[ id ];
    LL_GPIO_Init( usart_gpio_hwflow_port[ id ], &GPIO_InitStructure );
    return PLATFORM_OK;
  }
  if( type & PLATFORM_UART_FLOW_CTS )
  {
    temp |= LL_USART_HWCONTROL_CTS;
    GPIO_InitStructure.Pin = usart_gpio_cts_pin[ id ];
    LL_GPIO_Init( usart_gpio_hwflow_port[ id ], &GPIO_InitStructure );
  }
  if( type & PLATFORM_UART_FLOW_RTS )
  {
    temp |= LL_USART_HWCONTROL_RTS;
    GPIO_InitStructure.Pin = usart_gpio_rts_pin[ id ];
    GPIO_InitStructure.Mode = LL_GPIO_MODE_ALTERNATE;
    LL_GPIO_Init( usart_gpio_hwflow_port[ id ], &GPIO_InitStructure );
  }
  usart->CR3 |= temp;
  return PLATFORM_OK;
}

// ****************************************************************************
// Timers

u8 stm32_timer_int_periodic_flag[ NUM_PHYS_TIMER ];

// We leave out TIM6/TIM1 for now, as they are dedicated
// TODO: Utilize the other channels in these timers! Right now we are just using channel 1...
const TIM_TypeDef * const timer[] = {
  TIM2,   // ID: 0 (4 channels)
  TIM3,   // ID: 1 (4 channels)
  TIM4,   // ID: 2 (4 channels)
  TIM5,   // ID: 3 (4 channels)
  TIM15,  // ID: 4 (2 channels)
  TIM16,  // ID: 5 (1 channels)
  TIM17   // ID: 6 (1 channel)
};

const u8 timer_width[] = {
  32,  // ID: 0
  16,  // ID: 1
  16,  // ID: 2
  32,  // ID: 3
  16,  // ID: 4
  16,  // ID: 5
  16   // ID: 6
};

#define TIM_GET_PRESCALE( id ) ( (((id) == 4) || ((id) == 5)|| ((id) == 6)) ? ( PCLK2_DIV ) : ( PCLK1_DIV ) )
#define TIM_GET_BASE_CLK( id ) ( HCLK / ( TIM_GET_PRESCALE( id ) ) )

#define TIM_STARTUP_CLOCK       50000

static u32 platform_timer_set_clock( unsigned id, u32 clock );

void SysTick_Handler( void )
{
  // Handle virtual timers
  cmn_virtual_timer_cb();

  // Handle system timer call
  cmn_systimer_periodic();

#if defined( WATCHDOG_ENABLE )
  // Refresh watchdog if enabled
  WWDG_SetCounter( WATCH_COUNTER_RESET );
#endif

}

static void timers_init()
{
  unsigned i;

  // Enable PHB2 Clocks
  LL_APB2_GRP1_EnableClock( LL_APB2_GRP1_PERIPH_TIM1 );
  LL_APB2_GRP1_EnableClock( LL_APB2_GRP1_PERIPH_TIM8 );
  LL_APB2_GRP1_EnableClock( LL_APB2_GRP1_PERIPH_TIM15 );
  LL_APB2_GRP1_EnableClock( LL_APB2_GRP1_PERIPH_TIM16 );
  LL_APB2_GRP1_EnableClock( LL_APB2_GRP1_PERIPH_TIM17 );

  // Enable PHB1 Clocks
  LL_APB1_GRP1_EnableClock( LL_APB1_GRP1_PERIPH_TIM2 );
  LL_APB1_GRP1_EnableClock( LL_APB1_GRP1_PERIPH_TIM3 );
  LL_APB1_GRP1_EnableClock( LL_APB1_GRP1_PERIPH_TIM4 );
  LL_APB1_GRP1_EnableClock( LL_APB1_GRP1_PERIPH_TIM5 );
  LL_APB1_GRP1_EnableClock( LL_APB1_GRP1_PERIPH_TIM6 );


  // Configure timers
  for( i = 0; i < NUM_TIMER; i ++ )
    platform_timer_set_clock( i, TIM_STARTUP_CLOCK );
}

static u32 platform_timer_get_clock( unsigned id )
{
  TIM_TypeDef* ptimer = (TIM_TypeDef*)timer[ id ];
  return TIM_GET_BASE_CLK( id ) / ( LL_TIM_GetPrescaler( ptimer ) + 1 );
}

static u32 platform_timer_set_clock( unsigned id, u32 clock )
{
  LL_TIM_InitTypeDef timer_base_struct;
  LL_TIM_StructInit(&timer_base_struct);
  TIM_TypeDef *ptimer = (TIM_TypeDef*)timer[ id ];
  u32 pre = ( TIM_GET_BASE_CLK( id ) / clock ) - 1;

  if( pre > 65535 ) // Limit prescaler to 16-bits
    pre = 65535;

  timer_base_struct.Autoreload = ( timer_width[id] == 32 ? 0xFFFFFFFF : 0xFFFF );
  timer_base_struct.Prescaler = ( u16 )pre;
  timer_base_struct.ClockDivision = LL_TIM_CLOCKDIVISION_DIV1;
  timer_base_struct.CounterMode = LL_TIM_COUNTERMODE_UP;
  timer_base_struct.RepetitionCounter = 0x0000;
  LL_TIM_Init( (TIM_TypeDef*)timer[ id ], &timer_base_struct );
  LL_TIM_EnableCounter( ptimer );

  return  platform_timer_get_clock( id );
}

void platform_s_timer_delay( unsigned id, timer_data_type delay_us )
{
  TIM_TypeDef *ptimer = (TIM_TypeDef*)timer[ id ];
  volatile unsigned dummy;
  timer_data_type final;

  final = ( ( u64 )delay_us * platform_timer_get_clock( id ) ) / 1000000;
  LL_TIM_SetCounter( ptimer, 0 );
  // clear update flag so we can detect when it wraps
  ptimer->SR &= ~TIM_SR_UIF;
  for( dummy = 0; dummy < 200; dummy ++ );
  u64 timer_period = (u64)ptimer->ARR + 1;
  while( LL_TIM_GetCounter( ptimer ) < final )
  {
    if ( ptimer->SR & TIM_SR_UIF )
    {
      // timer has wrapped
      ptimer->SR &= ~TIM_SR_UIF;
      if ( final >= timer_period )
        final -= timer_period;
    }
  }
}

timer_data_type platform_s_timer_op( unsigned id, int op, timer_data_type data )
{
  u32 res = 0;
  TIM_TypeDef *ptimer = (TIM_TypeDef*)timer[ id ];
  volatile unsigned dummy;

  data = data;
  switch( op )
  {
    case PLATFORM_TIMER_OP_START:
      LL_TIM_SetCounter( ptimer, 0 ); //TIM_SetCounter( ptimer, 0 );
      for( dummy = 0; dummy < 200; dummy ++ );
      break;

    case PLATFORM_TIMER_OP_READ:
      res = LL_TIM_GetCounter( ptimer ); //TIM_GetCounter( ptimer );
      break;

    case PLATFORM_TIMER_OP_SET_CLOCK:
      res = platform_timer_set_clock( id, data );
      break;

