darren1713/elua/src/platform/stm32l4/platform.c
    case PLATFORM_TIMER_OP_GET_CLOCK:
      res = platform_timer_get_clock( id );
      break;

    case PLATFORM_TIMER_OP_GET_MAX_CNT:
      res = ( timer_width[id] == 32 ? 0xFFFFFFFF : 0xFFFF );
      break;

  }
  return res;
}

int platform_s_timer_set_match_int( unsigned id, timer_data_type period_us, int type )
{
  TIM_TypeDef* base = ( TIM_TypeDef* )timer[ id ];
  u64 period;
  u32 prescaler, freq;
  timer_data_type final;
  LL_TIM_OC_InitTypeDef TIM_OCInitStructure;

  if( period_us == 0 )
  {
    LL_TIM_DisableIT_CC1(base); //TIM_ITConfig( base, TIM_IT_CC1, DISABLE );
    return PLATFORM_TIMER_INT_OK;
  }

  period = ( ( u64 )TIM_GET_BASE_CLK( id ) * period_us ) / 1000000;

  prescaler = (u32)( period / ((u64)1 << timer_width[id]) ) + 1;

  if( prescaler > 0xFFFF )
    return PLATFORM_TIMER_INT_TOO_LONG;

  platform_timer_set_clock( id, TIM_GET_BASE_CLK( id  ) / prescaler );
  freq = platform_timer_get_clock( id );
  final = ( ( u64 )period_us * freq ) / 1000000;

  if( final == 0 )
    return PLATFORM_TIMER_INT_TOO_SHORT;

  LL_TIM_DisableCounter( base );

  LL_TIM_OC_StructInit( &TIM_OCInitStructure );
  TIM_OCInitStructure.OCMode = LL_TIM_OCMODE_FROZEN;
  TIM_OCInitStructure.OCState = LL_TIM_OCSTATE_ENABLE;
  TIM_OCInitStructure.CompareValue = final;
  TIM_OCInitStructure.OCPolarity = LL_TIM_OCPOLARITY_HIGH;
  LL_TIM_OC_Init( base, LL_TIM_CHANNEL_CH1, &TIM_OCInitStructure );

  // Patch timer configuration to reload when period is reached
  LL_TIM_SetAutoReload( base, final );

  LL_TIM_OC_EnablePreload( base, LL_TIM_CHANNEL_CH1 );

  stm32_timer_int_periodic_flag[ id ] = type;

  LL_TIM_SetCounter(base, 0); //TIM_SetCounter( base, 0 );
  LL_TIM_EnableCounter( base );

  return PLATFORM_TIMER_INT_OK;
}

u64 platform_timer_sys_raw_read()
{
  return SysTick->LOAD - SysTick->VAL;
}

void platform_timer_sys_disable_int()
{
  SysTick->CTRL &= ~( 1 << SysTick_CTRL_TICKINT_Pos );
}

void platform_timer_sys_enable_int()
{
  SysTick->CTRL |= 1 << SysTick_CTRL_TICKINT_Pos;
}

timer_data_type platform_timer_read_sys()
{
  return cmn_systimer_get();
}

// ****************************************************************************
// CAN
// TODO: Many things
#if (NUM_CAN > 0)

CAN_TypeDef *const stm32_can[] =             { CAN1 };
const u8 stm32_can_AF[] =                    { GPIO_AF_CAN1 };
static const u32 can_clock[] =               { LL_APB1_GRP1_PERIPH_CAN1 };

#if defined( ELUA_BOARD_STM32F4_CAN_PIN_CONFIG_1 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOD,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { LL_GPIO_PIN_0,          LL_GPIO_PIN_12 };
static const u8 can_gpio_rx_pin_source[] =   { LL_GPIO_AF_0,     LL_GPIO_AF_12 };
static const u16 can_gpio_tx_pin[] =         { LL_GPIO_PIN_1,          LL_GPIO_PIN_13 };
static const u8 can_gpio_tx_pin_source[] =   { LL_GPIO_AF_1,     LL_GPIO_AF_13 };

#elif defined( ELUA_BOARD_STM32F4_CAN_PIN_CONFIG_2 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOD,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { LL_GPIO_PIN_0,          LL_GPIO_PIN_5 };
static const u8 can_gpio_rx_pin_source[] =   { LL_GPIO_AF_0,     LL_GPIO_AF_5 };
static const u16 can_gpio_tx_pin[] =         { LL_GPIO_PIN_1,          LL_GPIO_PIN_6 };
static const u8 can_gpio_tx_pin_source[] =   { LL_GPIO_AF_1,     LL_GPIO_AF_6 };

#elif defined( ELUA_BOARD_STM32F4_CAN_PIN_CONFIG_3 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOB,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { LL_GPIO_PIN_8,          LL_GPIO_PIN_12 };
static const u8 can_gpio_rx_pin_source[] =   { LL_GPIO_AF_8,     LL_GPIO_AF_12 };
static const u16 can_gpio_tx_pin[] =         { LL_GPIO_PIN_9,          LL_GPIO_PIN_13 };
static const u8 can_gpio_tx_pin_source[] =   { LL_GPIO_AF_9,     LL_GPIO_AF_13 };

#elif defined( ELUA_BOARD_STM32F4_CAN_PIN_CONFIG_4 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOB,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { LL_GPIO_PIN_8,          LL_GPIO_PIN_5 };
static const u8 can_gpio_rx_pin_source[] =   { LL_GPIO_AF_8,     LL_GPIO_AF_5 };
static const u16 can_gpio_tx_pin[] =         { LL_GPIO_PIN_9,          LL_GPIO_PIN_6 };
static const u8 can_gpio_tx_pin_source[] =   { LL_GPIO_AF_9,     LL_GPIO_AF_6 };

#elif defined( ELUA_BOARD_STM32F4ALT ) || defined( ELUA_BOARD_STM32_E407 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOB,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { LL_GPIO_PIN_8,          LL_GPIO_PIN_12 };
static const u8 can_gpio_rx_pin_source[] =   { LL_GPIO_AF_8,     LL_GPIO_AF_12 };
static const u16 can_gpio_tx_pin[] =         { LL_GPIO_PIN_9,          LL_GPIO_PIN_13 };
static const u8 can_gpio_tx_pin_source[] =   { LL_GPIO_AF_9,     LL_GPIO_AF_13 };

#else

static GPIO_TypeDef *const can_gpio_port[] = { GPIOD,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { LL_GPIO_PIN_0,          LL_GPIO_PIN_12 };
static const u8 can_gpio_rx_pin_source[] =   { LL_GPIO_AF_0,     LL_GPIO_AF_12 };
static const u16 can_gpio_tx_pin[] =         { LL_GPIO_PIN_1,          LL_GPIO_PIN_13 };
static const u8 can_gpio_tx_pin_source[] =   { LL_GPIO_AF_1,     LL_GPIO_AF_13 };

#endif

void cans_init( void )
{
  // CAN Periph clock enable
  LL_APB1_GRP1_EnableClock(can_clock[0]);
}


#if ELUA_BOARD_CPU_CLOCK_HZ == 168000000

/*       BS1 BS2 SJW Pre
1M:      12  8   1   2
500k:    8   5   1   6
250k:    8   5   1   12
125k:    12  8   1   16
100k:    12  8   1   20 */

#define CAN_BAUD_COUNT 5
static const u8 can_baud_bs1[]    = { CAN_BS1_12tq, CAN_BS1_12tq, CAN_BS1_8tq, CAN_BS1_8tq, CAN_BS1_12tq };
static const u8 can_baud_bs2[]    = { CAN_BS1_8tq,  CAN_BS1_8tq,  CAN_BS1_5tq, CAN_BS1_5tq, CAN_BS1_8tq };
static const u8 can_baud_sjw[]    = { CAN_SJW_1tq,  CAN_SJW_1tq,  CAN_SJW_1tq, CAN_SJW_1tq, CAN_SJW_1tq };
static const u8 can_baud_pre[]    = { 20, 16, 12, 6, 2 };

#endif

#if ELUA_BOARD_CPU_CLOCK_HZ == 120000000

/*       BS1 BS2 SJW Pre
1M:      6   3   1   3
500k:    12  7   1   3
250k:    12  7   1   6
125k:    12  7   1   12
100k:    12  7   1   15 */

