darren1713/elua/src/platform/stm32l4/platform.c
        /* Clear ADDR flag value in ISR register */
        LL_I2C_ClearFlag_ADDR(I2C1);

        /* Enable Transmit Interrupt */
        LL_I2C_EnableIT_TX(I2C1);
      }
      else //Penev: Write transaction
      {

        I2C_Master_read_write = 0;
        
        /* Clear ADDR flag value in ISR register */
        LL_I2C_ClearFlag_ADDR(I2C1);
        
        /* Enable Receive Interrupt */
        LL_I2C_EnableIT_RX(I2C1);
        
      }
    }
    else
    {
      /* Clear ADDR flag value in ISR register */
      LL_I2C_ClearFlag_ADDR(I2C1);
        
      /* Call Error function */
      Error_Callback();
    }
  }
  /* Penev Check if we have data to receive*/  
  else if(LL_I2C_IsActiveFlag_RXNE(I2C1))
  {
        /* read the received data */
        slave_received_data=LL_I2C_ReceiveData8(I2C1);
  }  
  /* Check NACK flag value in ISR register */
  else if(LL_I2C_IsActiveFlag_NACK(I2C1))
  {
    /* End of Transfer */
    LL_I2C_ClearFlag_NACK(I2C1);
  }
  /* Check TXIS flag value in ISR register */
  else if(LL_I2C_IsActiveFlag_TXIS(I2C1))
  {
    /* We transmit the same data we have received during write transaction */
    LL_I2C_TransmitData8(I2C1, slave_received_data);

  }
  /* Check STOP flag value in ISR register */
  else if(LL_I2C_IsActiveFlag_STOP(I2C1))
  {
    /* Clear STOP flag value in ISR register */
    LL_I2C_ClearFlag_STOP(I2C1);
    
    /* Check TXE flag value in ISR register */
    if(!LL_I2C_IsActiveFlag_TXE(I2C1))
    {
      /* Flush the TXDR register */
      LL_I2C_ClearFlag_TXE(I2C1);
    }
  }
  /* Check TXE flag value in ISR register */
  else if(!LL_I2C_IsActiveFlag_TXE(I2C1))
  {
    /* Do nothing */
    /* This Flag will be set by hardware when the TXDR register is empty */
    /* If needed, use LL_I2C_ClearFlag_TXE() interface to flush the TXDR register  */
  }
  else
  {
    /* Call Error function */
    Error_Callback();
  }
}

/**
  * Brief   This function handles I2C3 (Master) interrupt request.
  * Param   None
  * Retval  None
  */
void I2C3_EV_IRQHandler(void)
{
  
  /* Penev: We get this flag after the slave has received address and responds with ACK */
  if(LL_I2C_IsActiveFlag_TXIS(I2C3))
  {
    /* Master sends data to the slave */
    LL_I2C_TransmitData8(I2C3, master_data_to_send);
  }  
  /* Check RXNE flag value in ISR register */
  else if(LL_I2C_IsActiveFlag_RXNE(I2C3))
  {
 
    /* Read character in Receive Data register.
       RXNE flag is cleared by reading data in RXDR register */
    master_received_data = LL_I2C_ReceiveData8(I2C3);

  }
  /* Check STOP flag value in ISR register */
  else if(LL_I2C_IsActiveFlag_STOP(I2C3))
  {
    /* End of Transfer */
    LL_I2C_ClearFlag_STOP(I2C3);

    /* Read transaction complete */
    if(I2C_Master_read_write)
	{
      I2C_Master_read_complete = 1;
	}
  }
  else
  {
    /* Call Error function */
    Error_Callback();
  }
}

